In [2]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
%matplotlib inline

In [4]:
df = pd.read_csv('titanic.csv.txt')

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
x = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [10]:
x.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [11]:
from sklearn.preprocessing import LabelEncoder

In [13]:
le = LabelEncoder()
x.Sex = le.fit_transform(x.Sex)

In [28]:
x.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [26]:
x.Age = x.Age.fillna(x.Age.mean())
x.Fare = X.Fare.fillna(x.Fare.median())

In [29]:
y = df['Survived']

In [39]:
trainx,testx,trainy,testy = train_test_split(x,y)
trainx.head()

     Pclass  Sex   Age    Fare
682       3    1  20.0   9.225
558       1    0  39.0  79.650
549       2    1   8.0  36.750
200       3    1  28.0   9.500
419       3    0  10.0  24.150

In [32]:
from sklearn.tree import DecisionTreeClassifier
cl = DecisionTreeClassifier()
cl.fit(trainx,trainy)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [33]:
cl.score(testx,testy)

0.7757847533632287

In [34]:
ypred = cl.predict(testx)

In [35]:
accuracy_score(testy,ypred)

0.7757847533632287

In [37]:
test = pd.read_csv('test.csv')

In [38]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [40]:
t = test[['Pclass','Sex','Age','Fare']]

In [42]:
t.Pclass = t.Pclass.fillna(t.Pclass.mode())

In [50]:
t.Fare = t.Fare.fillna(t.Fare.mean())
t.Age = t.Age.fillna(t.Age.mean())

In [51]:
t.head()

   Pclass  Sex   Age     Fare
0       3    1  34.5   7.8292
1       3    0  47.0   7.0000
2       2    1  62.0   9.6875
3       3    1  27.0   8.6625
4       3    0  22.0  12.2875

In [52]:
t.Sex = le.fit_transform(t.Sex)

C:\Users\saravanan\anaconda3\lib\site-packages\pandas\core\generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

In [53]:
t.head()

   Pclass  Sex   Age     Fare
0       3    1  34.5   7.8292
1       3    0  47.0   7.0000
2       2    1  62.0   9.6875
3       3    1  27.0   8.6625
4       3    0  22.0  12.2875

In [54]:
res = cl.predict(t)

In [57]:
res.shape

(418,)

In [58]:
t.shape

(418, 4)

In [72]:
solution = pd.DataFrame([test.PassengerId,res])

In [73]:
solution.shape

(2, 418)

In [74]:
solution = solution.T

In [75]:
solution.shape

(418, 2)

In [76]:
solution

     PassengerId  Unnamed 0
0            892          1
1            893          0
2            894          1
3            895          0
4            896          1
..           ...        ...
413         1305          0
414         1306          1
415         1307          0
416         1308          0
417         1309          0

[418 rows x 2 columns]